GabrielPCamargo/nke_esp32c3/src/NKE.c
/*
 * 
 * Versao com implementação de fila de print - 
 *    06/06/2025 
 *
*/

#include <mdk.h>
#include <esp32c3_regs.h>

/*
*
* Vari veis do Kernel
*
*/
/*Define intervalo das interrup  es de Clock 
 * Tabela de Interrup  es :
 * 1       ClkT = 1   segundo
 * 0.1     ClkT = 100 milissegundos
 * 0.01    Clkt = 10  milissegundos
 * 0.001   Clkt = 1   milissegundo
 * 0.0001  ClkT = 100 microssegundos
 * 0.00001 ClkT = 10  microssegundos
*/
#define ClkT 2 //equivale a 2 segundos

// SYSTIMER clock ESP32C3 = 16 MHz → 1000 ms = 16_000_000 ticks
#define Slice 16000000UL //1 segundo
#define MaxNumberTask 4
#define NUM_TASKS 4
#define SizeTaskStack 2048// Tamanho da pilha da tarefa
#define MAX_NKREAD_QUEUE 5 // N mero m ximo de threads esperando por leitura
#define MAX_NKPRINT_QUEUE 50 // Número máximo de mensagens esperando por impressão
#define MAX_NAME_LENGTH 30
unsigned int NumberTaskAdd=-1;
volatile int TaskRunning = 0;
char myName[MAX_NAME_LENGTH];
int  SchedulerAlgorithm ;


enum Scheduler{
  RR,
  RM,
  EDF
};
enum Taskstates{
  INITIAL,
  READY,
  RUNNING,
  DEAD,
  BLOCKED
};
typedef struct 
{
    int queue[MaxNumberTask];
    int tail;
    int head;
}ReadyList;
ReadyList ready_queue;

typedef struct 
{
  short count;
  int sem_queue[MaxNumberTask], tail, header;
}sem_t;

typedef struct {
    int tid; // ID da thread esperando pela leitura
    const char *format; // Formato da entrada esperado (similar ao scanf)
    void *var; // Argumentos onde os dados ser o armazenados
} NkReadQueueEntry;

typedef struct {
    const char *format; // Formato da entrada esperado (similar ao printf)
    char type; // 'd', 'f', 'c', 's', '%'
    union {
        int i;
        float f;
        char c;
        const char *s;
    } var; // Variável que será impressa
} NkPrintQueueEntry;

NkReadQueueEntry nkreadQueue[MAX_NKREAD_QUEUE];
int nkreadQueueHead = 0;
int nkreadQueueTail = 0;

NkPrintQueueEntry nkprintQueue[MAX_NKPRINT_QUEUE];
int nkprintQueueHead = 0;
int nkprintQueueTail = 0;
volatile bool printTailMutex;
volatile bool printHeadMutex;

char serialInputBuffer[128]; // Buffer para armazenar a entrada da serial
int serialInputIndex = 0;

typedef struct
{
  int CallNumber;
  unsigned char *p0;
  unsigned char *p1;
  unsigned char *p2;
  unsigned char *p3;
}Parameters;
volatile Parameters kernelargs ;


typedef struct {
  int16_t Tid;
  const char *name;
  unsigned short Prio;
  uint8_t Period;
  uint8_t Wcet;
  uint8_t DynamicPeriod;
  uint8_t DynamicWcet;
  unsigned int Time;
  unsigned short Join;
  unsigned short State;
  uint8_t Stack[SizeTaskStack]; // Vetor de pilha
  uint8_t* P; // Ponteiro de pilha
} TaskDescriptor;
TaskDescriptor Descriptors[MaxNumberTask]; // Array de descritores de tarefas


// Aparentemente estava quebrando sem os paddings (mas revisar)
typedef struct {
    uint32_t ra, t0, t1, t2;
    uint32_t s0, s1;
    uint32_t a0, a1, a2, a3, a4, a5, a6, a7;
    uint32_t s2, s3, s4, s5, s6, s7, s8, s9, s10, s11;
    uint32_t t3, t4, t5, t6;
    uint32_t mstatus, mepc;
    uint32_t padding1, padding2;
} Context;
/*
*Servicos do kernel
*
*/
enum sys_temCall{
  TASKCREATE,
  SEM_WAIT,
  SEM_POST,
  SEM_INIT,
  WRITELCDN,
  WRITELCDS,
  EXITTASK,
  SLEEP,
  MSLEEP,
  USLEEP,
  RMSSLEEP,
  LIGALED,
  DESLIGALED,
  START, 
  TASKJOIN,
  SETMYNAME,
  GETMYNAME,
  NKPRINT,
  GETMYNUMBER,
  NKREAD,
};

/*************************************************************
*                                                            *
* Rotinas do kernel                                          *
*                                                            *
*                                                            *
*************************************************************/

void kernel(Parameters *args) {
    kernelargs = *args;

    switch(kernelargs.CallNumber){
    case TASKCREATE: 
      sys_taskcreate((int *)kernelargs.p0,(void(*)())kernelargs.p1,(uint8_t)kernelargs.p2, (uint8_t)kernelargs.p3);
      break;
    case SEM_WAIT: 
     // Serial.println("SEMWAIT: ") ;
      sys_semwait((sem_t *)kernelargs.p0);
      break;
    case SEM_POST: 
      sys_sempost((sem_t *)kernelargs.p0);
      break;
    case SEM_INIT: 
      //Serial.println("SEMINIT: ") ;
      sys_seminit((sem_t *)kernelargs.p0,(int)kernelargs.p1);
      break;
    case WRITELCDN: // NAO TEREMOS
      // LCDcomando((int)arg->p1);
      // LCDnum((int)arg->p0);
      break;
    case WRITELCDS: // NAO TEREMOS
      // LCDcomando((int)arg->p1);
      // LCDputs((char*)arg->p0);
      break;
    case EXITTASK: 
      sys_taskexit();
      break;
    case SLEEP: 
      sys_sleep((int)kernelargs.p0);
      break;
    case MSLEEP: 
      sys_msleep((int)kernelargs.p0);
      break;
    case USLEEP: 
      sys_usleep((int)kernelargs.p0);
      break;
    case RMSSLEEP: 
      sys_rmssleep();
      break;
    case LIGALED: 
      sys_ligaled();
      break;
    case DESLIGALED: 
      sys_desligaled();
      break;
    case START: 
      sys_start((int)kernelargs.p0);
      break;
    case TASKJOIN: // NAO TEREMOS
     // sys_taskjoin((int)arg->p0);
      break;
    case SETMYNAME: 
      sys_setmyname((const char *)kernelargs.p0);
      break;
    case GETMYNAME: 
      sys_getmyname((const char *)kernelargs.p0);
      break;  
    case NKPRINT: 
       sys_nkprint((char *)kernelargs.p0,(void *)kernelargs.p1);
       break;
    case GETMYNUMBER: 
       sys_getmynumber((int *)kernelargs.p0);
       break;
    case NKREAD: 
       sys_nkread((char *)kernelargs.p0,(void *)kernelargs.p1);
       break;
    default:
       break;
  }
}


// --- MACROS DE CONTEXTO ---
#define SAVE_CONTEXT \
    "addi sp, sp, -128 \n\t" \
    "sw ra, 0(sp) \n\t" \
    "sw t0, 4(sp) \n\t" \
    "sw t1, 8(sp) \n\t" \
    "sw t2, 12(sp) \n\t" \
    "sw s0, 16(sp) \n\t" \
    "sw s1, 20(sp) \n\t" \
    "sw a0, 24(sp) \n\t" \
    "sw a1, 28(sp) \n\t" \
    "sw a2, 32(sp) \n\t" \
    "sw a3, 36(sp) \n\t" \
    "sw a4, 40(sp) \n\t" \
    "sw a5, 44(sp) \n\t" \
    "sw a6, 48(sp) \n\t" \
    "sw a7, 52(sp) \n\t" \
    "sw s2, 56(sp) \n\t" \
    "sw s3, 60(sp) \n\t" \
    "sw s4, 64(sp) \n\t" \
    "sw s5, 68(sp) \n\t" \
    "sw s6, 72(sp) \n\t" \
    "sw s7, 76(sp) \n\t" \
    "sw s8, 80(sp) \n\t" \
    "sw s9, 84(sp) \n\t" \
    "sw s10, 88(sp) \n\t" \
    "sw s11, 92(sp) \n\t" \
    "sw t3, 96(sp) \n\t" \
    "sw t4, 100(sp) \n\t" \
    "sw t5, 104(sp) \n\t" \
    "sw t6, 108(sp) \n\t" \
    "csrr t0, mstatus \n\t" \
    "sw t0, 112(sp) \n\t" \
    "csrr t0, mepc \n\t" \
    "sw t0, 116(sp) \n\t"

#define RESTORE_CONTEXT \
    "lw t0, 116(sp) \n\t" \
    "csrw mepc, t0 \n\t" \
    "lw t0, 112(sp) \n\t" \
    "csrw mstatus, t0 \n\t" \
    "lw ra, 0(sp) \n\t" \
    "lw t0, 4(sp) \n\t" \
    "lw t1, 8(sp) \n\t" \
    "lw t2, 12(sp) \n\t" \
    "lw s0, 16(sp) \n\t" \
    "lw s1, 20(sp) \n\t" \
    "lw a0, 24(sp) \n\t" \
    "lw a1, 28(sp) \n\t" \
    "lw a2, 32(sp) \n\t" \
    "lw a3, 36(sp) \n\t" \
    "lw a4, 40(sp) \n\t" \
    "lw a5, 44(sp) \n\t" \
    "lw a6, 48(sp) \n\t" \
    "lw a7, 52(sp) \n\t" \
    "lw s2, 56(sp) \n\t" \
    "lw s3, 60(sp) \n\t" \
    "lw s4, 64(sp) \n\t" \
    "lw s5, 68(sp) \n\t" \
    "lw s6, 72(sp) \n\t" \
    "lw s7, 76(sp) \n\t" \
    "lw s8, 80(sp) \n\t" \
    "lw s9, 84(sp) \n\t" \
    "lw s10, 88(sp) \n\t" \
    "lw s11, 92(sp) \n\t" \
    "lw t3, 96(sp) \n\t" \
    "lw t4, 100(sp) \n\t" \
    "lw t5, 104(sp) \n\t" \
    "lw t6, 108(sp) \n\t" \
    "addi sp, sp, 128 \n\t" \
    "mret \n\t"


void timer_interrupt_clear() {
    SYSTIMER_INT_CLR = (1U << 0);
    (void)SYSTIMER_INT_ST;
}

uint32_t handle_timer(uint32_t current_sp) {
    // Salva o SP da tarefa atual no seu descritor para retornar depois
    Descriptors[TaskRunning].P = (uint8_t *)current_sp;
    timer_interrupt_clear();
    
    wakeUP();
    switchTaskUnsafe(); 
    processPrintQueue();
    
    return (uint32_t)Descriptors[TaskRunning].P;
}

uint32_t handle_ecall(uint32_t current_sp) {
    uint32_t mcause_val;
    // Lê o registrador que nos diz O QUE causou a interrupção
    __asm__ volatile("csrr %0, mcause" : "=r"(mcause_val));

