GabrielPCamargo/nke_esp32c3/src/NKE.c
    // mcause 8 = Syscall de Usuário | mcause 11 = Syscall de Máquina
    if (mcause_val == 8 || mcause_val == 11) {

        Context *ctx = (Context *)current_sp;
        ctx->mepc += 4; // mepc em exceção aponta para a instrução ECALL, então PC é incrementado para evitar loop infinito.

        Parameters *args = (Parameters *)ctx->a0;

        // Se ecall não foi chamada por uma tarefa (TaskRunning == 0), o kernel retorna pra próxima linha (utilizado na criação de tasks no main)
        if (TaskRunning == 0) {
            kernel(args);
            return current_sp;
        }

        Descriptors[TaskRunning].P = (uint8_t *)current_sp;
        kernel(args); 
        return (uint32_t)Descriptors[TaskRunning].P;
    } 
    else {

        // Outra exceção encontrada!
        Context *ctx = (Context *)current_sp;
        printf("\n\n=== EXCEÇÃO DETECTADA ===\n");
        printf("Codigo mcause : %u\n", mcause_val);
        printf("mepc (Erro em): 0x%08x\n", ctx->mepc);
        printf("TaskRunning   : %d\n", TaskRunning);

        __asm__ volatile("csrci mstatus, 0x8"); 
        while(1); 
    }
}

__attribute__((naked, section(".iram1")))
void timer_vector(void) {
    __asm__ volatile (
        SAVE_CONTEXT
        "mv a0, sp \n\t"          // Passa o SP atual como argumento
        "call handle_timer \n\t"  // Chama a lógica C
        "mv sp, a0 \n\t"          // Assume o SP retornado (pode ser de outra tarefa)
        RESTORE_CONTEXT
    );
}

__attribute__((naked, section(".iram1")))
void ecall_vector(void) {
    __asm__ volatile (
        SAVE_CONTEXT
        "mv a0, sp \n\t"          // Passa o SP atual como argumento
        "call handle_ecall \n\t"  // Chama a lógica C
        "mv sp, a0 \n\t"          // Assume o SP retornado (pode ser de outra tarefa)
        RESTORE_CONTEXT
    );
}

void callsvc(Parameters *args)
{
    // 1. Força o compilador a colocar o ponteiro 'args' no registrador a0.
    // O registrador a0 é o padrão (ABI) para passar o primeiro argumento.
    register Parameters *a0 asm("a0") = args;

    // 2. Chama a exceção de hardware "Environment Call" (ecall).
    // O hardware automaticamente pula para o 'ecall_vector'
    __asm__ volatile("ecall" : : "r"(a0) : "memory");
}


//Função para iniciar a primeira tarefa. O ponteiro da pilha é enviado para a0 (procure ABI=ilp32 para mais informações)
// O atributo naked é crucial para evitar que o compilador adicione prólogo/epílogo, dando controle total sobre o que acontece no início da tarefa.
__attribute__((naked))
void startOS(uint8_t* initial_sp) {
    __asm__ volatile (
        "mv sp, a0 \n\t"
        RESTORE_CONTEXT
    );
}


// Vetor de interrupção, sem prólogo/epílogo, alinhado em 256 bytes para garantir que cada ID de interrupção seja corretamente mapeada para seu handler.
__attribute__((naked, section(".iram1"), aligned(256)))
void vector_table(void)
{
    __asm__ volatile (
        ".option push\n"    // salva opções atuais (antes de tirar o norvc)
        ".option norvc\n"   // sem otimização de instruções comprimidas para garantir que cada salto seja exatamente 4 bytes (uma instrução RISC-V normal)

        "j ecall_vector\n" // Handler de ecall (endereço base mtvec)
        "j .\n"
        "j .\n"
        "j .\n"
        "j .\n"
        "j .\n"
        "j timer_vector\n" // Handler de timer, id configurado na inialização do SYSTIMER

        ".option pop\n"    // restaura opções anteriores (antes do norvc ser ativado
    );
}


// SYSTIMER INIT — Modo período, procedimento exato do (Technical Reference Manual) TRM 10.5.3

static void systimer_init(void) {
    //Habilita clock do systimer geral e habilita a execução da UNIT0.
    SYSTIMER_CONF = (1U << 31) | (1U << 30);

    //Configura comparador 0, para timer da UNIT0 e período definido por Slice
    SYSTIMER_TARGET0_CONF = Slice & 0x3FFFFFF;

    //BIT 1 do COMP0_LOAD para sincronizar o período ao COMP0
    SYSTIMER_COMP0_LOAD = 1;

    // limpa e depois seta PERIOD_MODE (bit30) para entrar em modo período
    SYSTIMER_TARGET0_CONF = Slice & 0x3FFFFFF;                // PERIOD_MODE=0
    SYSTIMER_TARGET0_CONF = (1U << 30) | (Slice & 0x3FFFFFF); // PERIOD_MODE=1

    // habilita COMP0 via CONF_REG bit23 (TARGET0_WORK_EN)
    SYSTIMER_CONF = (1U << 31) | (1U << 30) | (1U << 24);

    // Limpa e habilita interrupção do COMP0 (bit0)
    SYSTIMER_INT_CLR = 1U;
    SYSTIMER_INT_ENA = 1U;

    // Roteamento INTMTX_SYSTIMER_T0 para CPU_INTR_TIMER e habilitação da interrupção no controlador
    INTMTX_SYSTIMER_T0_MAP     = CPU_INTR_TIMER;
    INTCTL_ENABLE             |= (1U << CPU_INTR_TIMER);
    INTCTL_PRI(CPU_INTR_TIMER) = 2; // Prioridade média-baixa para não atrapalhar outras ISRs críticas
}

void wakeUP() //acorda a task bloqueada a espera de passagem de tempo
{
  int i=1;
  for(i=1;i<NUM_TASKS; i++)
  {
    //sleep
    if(Descriptors[i].Time>0)
    {
      Descriptors[i].Time--;
      if(Descriptors[i].Time <= 0 && Descriptors[i].State == BLOCKED && Descriptors[i].State != READY)
      {
        Descriptors[i].State = READY;
        InsertReadyList(i) ; //tempo de espera se esgotou
      }
    }

    if(Descriptors[i].DynamicPeriod>0)
    {
      Descriptors[i].DynamicPeriod--;
      if(Descriptors[i].DynamicPeriod <= 0) {
        Descriptors[i].DynamicPeriod = Descriptors[i].Period;
        Descriptors[i].DynamicWcet = Descriptors[i].Wcet;
        if(i != TaskRunning && Descriptors[i].State != READY) { // ← só insere se não estiver rodando
            Descriptors[i].State = READY;
            InsertReadyList(i);
        }
      }
    }
  }

  if(Descriptors[TaskRunning].DynamicWcet>0)
  {
    Descriptors[TaskRunning].DynamicWcet--;
    if(Descriptors[TaskRunning].DynamicWcet <= 0)
    {
      Descriptors[TaskRunning].State = BLOCKED;
    }
  }
}

//Escalonador

/*
* Imprime a Ready List
* Usada para  testes
*/
void printReadyList() {
    nkprint("Ready list tasks: ", 0);
    for (int i = 0; i < ready_queue.head; i++) {
        nkprint(" Index:", 0);
        nkprint("%d", (void *)&ready_queue.queue[i]);
    }
    nkprint("\n", 0);
}


