GabrielPCamargo/nke_esp32c3/src/NKE.c
    char type = 'd';
    if (strchr(format, '%')) {
      char *percent = strchr(format, '%');
      switch (*(percent + 1)) {
        case 'd': type = 'd'; break;
        case 'f': type = 'f'; break;
        case 'c': type = 'c'; break;
        case 's': type = 's'; break;
        case '%': type = '%'; break;
      }
    }

    nkprintQueue[nkprintQueueTail].format = format;
    nkprintQueue[nkprintQueueTail].type = type;

    switch (type) {
      case 'd':
        if (var != NULL)
            nkprintQueue[nkprintQueueTail].var.i = *(int *)var;
        else
            nkprintQueue[nkprintQueueTail].var.i = 0;
        break;
      case 'f':
        nkprintQueue[nkprintQueueTail].var.f = *(float *)var;
        break;
      case 'c':
        nkprintQueue[nkprintQueueTail].var.c = *(char *)var;
        break;
      case 's':
        nkprintQueue[nkprintQueueTail].var.s = (const char *)var;
        break;
      default:
        break;
    }

    nkprintQueueTail = (nkprintQueueTail + 1) % MAX_NKPRINT_QUEUE;
    printTailMutex = false; // Libera o printTailMutex
}

NkPrintQueueEntry dequeueNkPrint() {
    while(printHeadMutex == true); // Espera se printHeadMutex estiver ocupado
    printHeadMutex = true; // Bloqueia o printHeadMutex
    NkPrintQueueEntry entry = nkprintQueue[nkprintQueueHead];
    nkprintQueueHead = (nkprintQueueHead + 1) % MAX_NKPRINT_QUEUE;
    printHeadMutex = false; // Libera o printHeadMutex
    return entry;
}

void sys_nkprint(const char *format, void *var) {
  // Adicionar a mensagem na fila de escrita
  enqueueNkPrint(Descriptors[TaskRunning].Tid, format, var);
  //switchTask();
}

void serial_print(const char *fmt, NkPrintQueueEntry entry)
{
  float *auxfloat;
    switch(entry.type)
    {
        case 'd':
            printf(fmt, entry.var.i);
            break;

        case 'c':
            printf(fmt, entry.var.c);
            break;

        //Sem suporte para soft float com esse toolchain.
        case 'f':
          break;

        case 's':
            printf(fmt, entry.var.s);
            break;

        case '%':
            printf(fmt);
            break;

        default:
            printf("Formato invalido");
            break;
    }
}

void processPrintQueue() {
  while (printTailMutex);
  printTailMutex = true;
  int snapshotTail = nkprintQueueTail;
  printTailMutex = false;

  while (nkprintQueueHead != snapshotTail) {
    NkPrintQueueEntry entry = dequeueNkPrint();
    serial_print((char *)entry.format, entry);
  }
}


void sys_taskexit(void)
{
  Descriptors[TaskRunning].State=BLOCKED;
  switchTask();
}
void enqueueNkRead(int tid, const char *format, void *var) {
    nkreadQueue[nkreadQueueTail].tid = tid;
    nkreadQueue[nkreadQueueTail].format = format;
    nkreadQueue[nkreadQueueTail].var = var;
    nkreadQueueTail = (nkreadQueueTail + 1) % MAX_NKREAD_QUEUE;
}

NkReadQueueEntry dequeueNkRead() {
    NkReadQueueEntry entry = nkreadQueue[nkreadQueueHead];
    nkreadQueueHead = (nkreadQueueHead + 1) % MAX_NKREAD_QUEUE;
    return entry;
}

void sys_nkread(const char *format, void *var) {
  // Adicionar a thread atual na fila de leitura
  enqueueNkRead(Descriptors[TaskRunning].Tid, format, var);
  // Bloquear a thread atual
  Descriptors[TaskRunning].State = BLOCKED;
  switchTask();
}

float stringToFloat(const char* str) {
    float result = 0.0;
    float factor = 1.0;

    if (*str == '-') {
        str++;
        factor = -1.0;
    }

    // Parte inteira
    for (; *str >= '0' && *str <= '9'; str++) {
        result = result * 10.0 + (*str - '0');
    }

    // Parte fracion?ria
    if (*str == '.') {
        float fraction = 0.1;
        str++;
        for (; *str >= '0' && *str <= '9'; str++) {
            result += (*str - '0') * fraction;
            fraction *= 0.1;
        }
    }

    return result * factor;
}

// void serialEvent() {
//     while (Serial.available()) {
//         char c = Serial.read();
//         if (c == '\n') {
//             serialInputBuffer[serialInputIndex] = '\0';  // Termina a string
//             serialInputIndex = 0;  // Reinicia o ?ndice

//             // Desbloquear a thread que esta esperando por entrada
//             if (nkreadQueueHead != nkreadQueueTail) {
//                 NkReadQueueEntry entry = dequeueNkRead();
//                 if (strcmp(entry.format, "%f") == 0) {
//                     // Para float, usar nossa fun??o auxiliar
//                     *(float *)(entry.var) = stringToFloat(serialInputBuffer);
//                 } else {
//                     // Interpretar a entrada de acordo com o formato fornecido
//                     sscanf(serialInputBuffer, entry.format, entry.var);
//                 }
//                 Descriptors[entry.tid].State = READY;
//             }
//         } else {
//             if (serialInputIndex < 127) {
//                 serialInputBuffer[serialInputIndex++] = c;
//             }
//         }
//     }
// }


/*************************************************************
*                                                            *
* Chamadas de Sistema a N vel de usu rio                     *
*           User Call                                        *
*                                                            *
*************************************************************/

void taskcreate(int *ID,void (*funcao)(), uint8_t period, uint8_t wcet) //parametros armazenados em R0 e R1 na chamada
{
  Parameters arg;
  printf("taskcreate called with funcao=%p, period=%d, wcet=%d\n", funcao, period, wcet); // Debug
  arg.CallNumber=TASKCREATE;
  arg.p0=(unsigned char *)ID;
  arg.p1=(unsigned char *)funcao;
  arg.p2=(unsigned char *)(uint16_t)period;
  arg.p3=(unsigned char *)(uint16_t)wcet;
  callsvc(&arg);
}
void start(int scheduler)
{
  Parameters arg;
  arg.CallNumber=START;
  arg.p0=(unsigned char *)scheduler;
  callsvc(&arg);
}
void semwait(sem_t *semaforo)
{
  Parameters arg;
  arg.CallNumber=SEM_WAIT;
  arg.p0=(unsigned char *)semaforo;
  callsvc(&arg);
}

void sempost(sem_t *semaforo)
{
  Parameters arg;
  arg.CallNumber=SEM_POST;
  arg.p0=(unsigned char *)semaforo;
  callsvc(&arg);
}

void seminit(sem_t *semaforo, int ValorInicial)
{
  Parameters arg;
  arg.CallNumber=SEM_INIT;
  arg.p0=(unsigned char *)semaforo;
  arg.p1=(unsigned char *)ValorInicial;
  callsvc(&arg);
}
void setmyname(const char *name)
{
  Parameters arg;
  arg.CallNumber=SETMYNAME;
  arg.p0=(unsigned char *)name;
  callsvc(&arg);
}
void getmynumber(int *number)
{
  Parameters arg;
  arg.CallNumber=GETMYNUMBER;
  arg.p0=(unsigned char *)number;
  callsvc(&arg);
}
void getmyname(const char *name)
{
  Parameters arg;
  arg.CallNumber=GETMYNAME;
  arg.p0=(unsigned char *)name;
  callsvc(&arg);
}
void sleep(int time)
{
  Parameters arg;
  arg.CallNumber=SLEEP;
  arg.p0=(unsigned char *)time;
  callsvc(&arg);
}
void msleep(int time)
{  
  Parameters arg;
  arg.CallNumber=SLEEP;
  arg.CallNumber=MSLEEP;
  arg.p0=(unsigned char *)time;
  callsvc(&arg);
}

void usleep(int time)
{
  Parameters arg;
  arg.CallNumber=USLEEP;
  arg.p0=(unsigned char *)time;
  callsvc(&arg);
}
void rmssleep(void)
{
  Parameters arg;
  arg.CallNumber=RMSSLEEP;
  callsvc(&arg);
}
void taskexit(void)
{
  Parameters arg;
  arg.CallNumber=EXITTASK;
  callsvc(&arg);
}

void ligaled(void)
{
  Parameters arg;
  arg.CallNumber=LIGALED;
  callsvc(&arg);
}

void desligaled(void)
{
  Parameters arg;
  arg.CallNumber=DESLIGALED;
  callsvc(&arg);
}

void nkprint(char *fmt,void *number)
{
  Parameters arg;
  arg.CallNumber=NKPRINT;
  arg.p0=(unsigned char *)fmt;
  arg.p1=(unsigned char *)number;
  callsvc(&arg);
}
void nkread(const char *format, void *var) {
    Parameters arg;
    arg.CallNumber = NKREAD;
    arg.p0 = (unsigned char *)format;
    arg.p1 = (unsigned char *)var;
    callsvc(&arg);
}
/*************************************************************
*                                                            *
*                   Programa do  usu rio                     *
*                       - Aplica  o -                        *
*                                                            *
*************************************************************/


volatile int16_t tid0, tid1, tid2, tid3, tid4;
int i, j ;
//sem_t s0;
//sem_t s1;
//sem_t s2;
//sem_t s3;

