GabrielPCamargo/nke_esp32c3/src/NKE.c
void p0() { 
  static int number3;
  int teste = 10;
  char teste2 = 'A';
  float teste3 = 3.14159;
  char teste4[20] = "Hello, World!";
  getmynumber(&number3);
  while (1) {
    nkprint("P3 running\n", 0);
    nkprint("int: %d\n", &teste);
    nkprint("char: %c\n", &teste2);
    nkprint("percent: %%\n", 0);
    nkprint("string: %s\n", &teste4);
    sleep(2);
  }
}

void p1() {
  printf("'p1' started with TID: %d\n", 1);
  static int number1;
  getmynumber(&number1);
  while (1) {
    //printReadyList();
    nkprint("P1 running\n", 0);
    for(volatile long d = 0; d < 1816000L; d++);
    nkprint("P1 Finished\n", 0);
    rmssleep();
  }
}

void p2() {
  printf("'p2' started with TID: %d\n", 2);
  static int number2;
  getmynumber(&number2);
  while (1) {
    //printReadyList();
    nkprint("P2 running\n", 0);
    for(volatile long d = 0; d < 2724000L; d++);
    nkprint("P2 Finished\n", 0);
    rmssleep();
  }
}

/*************************************************************
*                                                            *
*               Setup e criar Tasks                    *
*                                                            *
*                                                            *
*************************************************************/

int main(void) {
    // Desabilita o Watchdog para evitar resets inesperados durante o desenvolvimento
    wdt_disable(); 
    
    //Configura o vetor de interrupção.
    __asm__ volatile ("csrw mtvec, %0" :: "r"((uintptr_t)vector_table)); 

    // Habilita interrupções globalmente (MIE=1)
    // Não é necessário pois cada tarefa tem seu próprio mstatus com MIE=1
    //__asm__ volatile ("csrsi mstatus, 0x8"); 
    

    // Verificar número das interrupções, talvez seja melhor trocar os defines para esse código.        
    nkprint("FakeOS \n", 0) ;
    nkprint("Versao 0.0 \n", 0) ;
    
    //seminit(&s0, 1);
    //seminit(&s1, 0);
    //seminit(&s2, 0);
    //seminit(&s3, 0);
    
    taskcreate(&tid0,idle,100, 50);
    taskcreate(&tid1,p0,10, 2);
    taskcreate(&tid2,p1,20, 5);
    taskcreate(&tid3,p2,30, 8);
    // taskcreate(&tid3,p3,1);

    start (RR) ;
    
    systimer_init();

    startOS(Descriptors[0].P); //coloca a task idle para rodar (não vai executar até a interrupção, vai ficar no while (1))

    // O código do main() não deve rodar nada, pois a task idle() já deve começar a executar.
    printf("Erro: main() foi executado! Isso não deveria acontecer.\n");
    while(1); 
}